# Koşullu Eleman İşlemleri

In [2]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    21     7    10
1    25    26     5
2     2    19    25
3    17    27    24
4    11     4    27
5    12     1    19
6    19     3    25
7    15     5    14
8     3    14    19
9    27    21     9

In [3]:
df["var3"]

0    10
1     5
2    25
3    24
4    27
5    19
6    25
7    14
8    19
9     9
Name: var3, dtype: int32

In [4]:
df["var3"][0:3]

0    10
1     5
2    25
Name: var3, dtype: int32

In [6]:
df[0:4][["var1","var2"]]

   var1  var2
0    21     7
1    25    26
2     2    19
3    17    27

In [7]:
df

   var1  var2  var3
0    21     7    10
1    25    26     5
2     2    19    25
3    17    27    24
4    11     4    27
5    12     1    19
6    19     3    25
7    15     5    14
8     3    14    19
9    27    21     9

In [8]:
df.var1

0    21
1    25
2     2
3    17
4    11
5    12
6    19
7    15
8     3
9    27
Name: var1, dtype: int32

In [9]:
df[df.var1 > 15]

   var1  var2  var3
0    21     7    10
1    25    26     5
3    17    27    24
6    19     3    25
9    27    21     9

In [10]:
df[df.var1 > 15]["var1"]

0    21
1    25
3    17
6    19
9    27
Name: var1, dtype: int32

In [13]:
df[(df.var1 > 15) & (df.var3 < 10)]

   var1  var2  var3
1    25    26     5
9    27    21     9

In [14]:
df[(df.var1 > 15) & (df.var3 < 10) & (df.var2 > 25)]

   var1  var2  var3
1    25    26     5

In [15]:
df

   var1  var2  var3
0    21     7    10
1    25    26     5
2     2    19    25
3    17    27    24
4    11     4    27
5    12     1    19
6    19     3    25
7    15     5    14
8     3    14    19
9    27    21     9

In [24]:
df[(df.var1 > 15)][["var1","var2"]]

   var1  var2
0    21     7
1    25    26
3    17    27
6    19     3
9    27    21

In [19]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
0    21     7
1    25    26
3    17    27
6    19     3
9    27    21